Dlubal.SteelSurfaces.LoadingType
Type of loading

Dlubal.SteelSurfaces.LoadingType.UnknownLoadingType
Unknown load type

Dlubal.SteelSurfaces.LoadingType.LoadCaseType
Load case

Dlubal.SteelSurfaces.LoadingType.LoadCombinationType
Load combination

Dlubal.SteelSurfaces.LoadingType.ResultCombinationType
Result combination

Dlubal.SteelSurfaces.LoadingType.SuperCombinationType
Super combination

Dlubal.SteelSurfaces.LoadingType.DynamicCaseType
Dynamic case

Dlubal.SteelSurfaces.LoadingType.DynamicCombinationType
Dynamic combination

Dlubal.SteelSurfaces.LoadingType.ModuleCaseType
Module case